app/views/users/index.html.erb


<p><%= User.count %> users</p>
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"