app/views/games/home.html.erb

SELECT  "teams".* FROM "teams" ORDER BY "teams"."id" ASC LIMIT $1  [["LIMIT", 1]]
---

<h2><%= Team.first.name %></h2>

SELECT  "teams".* FROM "teams" ORDER BY "teams"."id" DESC LIMIT $1  [["LIMIT", 1]]
---

<h2><%= Team.last.name %></h2>