app/views/players/_form.html.erb

SELECT "teams"."name", "teams"."id" FROM "teams"
---
  <%= f.label :team_id %><br>
  <%= f.select :team_id, Team.pluck(:name, :id)%><br><br>