app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    @players = Player.all

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @player = Player.find params[:id]

SELECT COUNT(*) FROM "players" WHERE "players"."team_id" = $1  [["team_id", 1]]
INSERT INTO "players" ("name", "position", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Josh Hazelwood"], ["position", "Bowler"], ["team_id", 1], ["created_at", "2021-10-22 05:53:46.888788"], ["updated_at", "2021-10-22 05:53:46.888788"]]
---
  def create
    @team = params[:team_id]
    if @team.players.count < 11
      player = Player.create player_params

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
---
  def edit
    @player = Player.find params[:id]

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "players" SET "position" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["position", "Fast Bowler"], ["updated_at", "2021-10-22 05:53:27.278403"], ["id", 11]]
---
  def update
    player = Player.find params[:id]
    player.update player_params

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = $1  [["id", 57]]
---
  def destroy
    player = Player.find params[:id]
    player.destroy