app/controllers/players_controller.rb

  def edit
    @player = Player.find params[:id]
    @team = Team.find @player.team_id
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]