app/controllers/teams_controller.rb

  def index
    @teams = Team.all
---
SELECT "teams".* FROM "teams"

  def show
    @team = Team.find params[:id]
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    team = Team.create team_params
---
INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Brisbane Heat"], ["created_at", "2021-10-22 04:59:34.276087"], ["updated_at", "2021-10-22 04:59:34.276087"]]

  def edit
    @team = Team.find params[:id]
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    team = Team.find params[:id]
    team.destroy
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 3]]